app/controllers/recipes_controller.rb

    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.chef = Chef.find(4)

        if @recipe.save
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "recipes" ("name", "summary", "description", "chef_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
        @recipe = Recipe.find(params[:id])
        if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Edited :Muya awandru"], ["updated_at", "2016-01-16 15:03:49.131699"], ["id", 5]]